In [1]:
from sqlalchemy import create_engine
import IPython
import psycopg2 as pg
import pgspecial

In [2]:
%load_ext sql

In [3]:
engine = create_engine('postgresql://postgres:password@localhost:5432/airport')

%sql $engine.url

'Connected: postgres@airport'

# Creating tables

In [4]:
%%sql

CREATE TABLE terminals (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL
);

CREATE TABLE gates (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    terminal_id INTEGER NOT NULL,
    FOREIGN KEY (terminal_id) REFERENCES terminals(id)
);

CREATE TABLE destinations (
    id SERIAL PRIMARY KEY,
    iata_code VARCHAR(255) NOT NULL,
    name VARCHAR(255) NOT NULL,
    country VARCHAR(255) NOT NULL
);

CREATE TABLE airlines (
    id SERIAL PRIMARY KEY,
    icao_code VARCHAR(255) NOT NULL,
    name VARCHAR(255) NOT NULL,
    country VARCHAR(255) NOT NULL
);

CREATE TABLE planes (
    id SERIAL PRIMARY KEY,
    registration VARCHAR(255),
    plane_type VARCHAR (255),
    airline_id INTEGER NOT NULL,
    FOREIGN KEY (airline_id) REFERENCES airlines(id)
);

CREATE TABLE flights (
    id SERIAL PRIMARY KEY,
    airline_id INTEGER NOT NULL,
    flight_number VARCHAR(255) NOT NULL,
    destination_id INTEGER NOT NULL,
    departure_time TIMESTAMP NOT NULL,
    arrival_time TIMESTAMP NOT NULL,
    plane_id INTEGER,
    gate_id INTEGER NOT NULL,
    FOREIGN KEY (airline_id) REFERENCES airlines(id),
    FOREIGN KEY (destination_id) REFERENCES destinations(id),
    FOREIGN KEY (plane_id) REFERENCES planes(id),
    FOREIGN KEY (gate_id) REFERENCES gates(id)
);

CREATE TABLE passengers (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(255) NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    email VARCHAR(255) NOT NULL,
    phone VARCHAR(255) NOT NULL,
    passport_num VARCHAR(255),
    flight_id INTEGER NOT NULL,
    FOREIGN KEY (flight_id) REFERENCES flights(id)
);

CREATE TABLE employees (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(255) NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    email VARCHAR(255) NOT NULL,
    phone VARCHAR(255) NOT NULL,
    position VARCHAR(255) NOT NULL,
    terminal_id INTEGER NOT NULL,
    FOREIGN KEY (terminal_id) REFERENCES terminals(id)
)

 * postgresql://postgres:***@localhost:5432/airport
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Adding some data

In [5]:
%%sql

INSERT INTO terminals (id, name) VALUES
(1, 'Terminal 1'),
(2, 'Terminal 2')

 * postgresql://postgres:***@localhost:5432/airport
2 rows affected.

[]

In [6]:
%%sql

INSERT INTO gates (id, name, terminal_id) VALUES
(1, 'Gate 1A', 1),
(2, 'Gate 2A', 1),
(3, 'Gate 3A', 1),
(4, 'Gate 4A', 1),
(5, 'Gate 5A', 1),
(6, 'Gate 1B', 2),
(7, 'Gate 2B', 2),
(8, 'Gate 3B', 2),
(9, 'Gate 4B', 2),
(10, 'Gate 5B', 2)

 * postgresql://postgres:***@localhost:5432/airport
10 rows affected.

[]

In [7]:
%%sql

INSERT INTO destinations (id, iata_code, name, country)
VALUES
    (1, 'LED', 'Pulkovo Airport', 'Russia'),
    (2, 'VVO', 'Vladivostok International Airport', 'Russia'),
    (3, 'AER', 'Sochi International Airport', 'Russia'),
    (4, 'GOJ', 'Nizhny Novgorod International Airport', 'Russia'),
    (5, 'KZN', 'Kazan International Airport', 'Russia'),
    (6, 'OVB', 'Tolmachevo Airport', 'Russia'),
    (7, 'ROV', 'Rostov-on-Don Airport', 'Russia'),
    (8, 'UFA', 'Ufa International Airport', 'Russia'),
    (9, 'KRR', 'Pashkovsky Airport', 'Russia'),
    (10, 'MRV', 'Mineralnye Vody Airport', 'Russia')

 * postgresql://postgres:***@localhost:5432/airport
10 rows affected.

[]

In [8]:
%%sql

INSERT INTO airlines (id, icao_code, name, country)
VALUES
    (1, 'AFL', 'Aeroflot', 'Russia'),
    (2, 'SDM', 'Rossiya Airlines', 'Russia'),
    (3, 'SBI', 'S7 Airlines', 'Russia'),
    (4, 'UTA', 'UTair Aviation', 'Russia')

 * postgresql://postgres:***@localhost:5432/airport
4 rows affected.

[]

In [9]:
%%sql

INSERT INTO planes (id, registration, plane_type, airline_id) VALUES
(1, 'N12345', 'Boeing 737-800', 4),
(2, 'N12346', 'Airbus A320', 1),
(3, 'N12347', 'Boeing 737', 4),
(4, 'N12348', 'Boeing 777-300', 1),
(5, 'N12349', 'Airbus A320', 3),
(6, 'N12350', 'Sukhoi 95', 2),
(7, 'N12351', 'Airbus A320', 2),
(8, 'N12352', 'Airbus A320', 3),
(9, 'N12353', 'Airbus A320', 3),
(10, 'N12354', 'Boeing 737-800', 4),
(11, 'N12355', 'Airbus A320', 3),
(12, 'N12356', 'Airbus A320', 3),
(13, 'N12357', 'Airbus A319', 2),
(14, 'N12358', 'Boeing 737-800', 1),
(15, 'N12359', 'Airbus A321', 1),
(16, 'N12360', 'Sukhoi 95', 2),
(17, 'N12361', 'Sukhoi 95', 2),
(18, 'N12362', 'Airbus A320', 3),
(19, 'N12363', 'Airbus A320', 3),
(20, 'N12364', 'Boeing 777-300', 1);

 * postgresql://postgres:***@localhost:5432/airport
20 rows affected.

[]

In [10]:
%%sql

INSERT INTO flights (id, airline_id, flight_number, destination_id, departure_time, arrival_time, plane_id, gate_id)
VALUES
    (1, 1, 'SU20',   1, '2022-12-11 12:00:00', '2022-12-11 14:00:00', 2, 1),
    (2, 1, 'SU1704', 2, '2022-12-11 13:00:00', '2022-12-11 21:00:00', 4, 2),
    (3, 1, 'SU1610', 3, '2022-12-11 14:00:00', '2022-12-11 17:00:00', 15, 3),
    (4, 2, 'SU7020', 4, '2022-12-11 15:00:00', '2022-12-11 16:30:00', 6, 4),
    (5, 3, 'S71133', 5, '2022-12-11 16:00:00', '2022-12-11 18:00:00', 11, 5),
    (6, 3, 'S71245', 6, '2022-12-11 17:00:00', '2022-12-11 20:00:00', 19, 6),
    (7, 2, 'SU3453', 7, '2022-12-11 18:00:00', '2022-12-11 20:00:00', 7, 7),
    (8, 3, 'S74532', 8, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 8, 8),
    (9, 1, 'SU5489', 9, '2022-12-11 18:00:00', '2022-12-11 20:00:00', 14, 9),
    (10, 2, 'SU3353', 10, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 16, 10),
    (11, 2, 'SU3443', 1, '2022-12-11 18:00:00', '2022-12-11 20:00:00', 17, 1),
    (12, 1, 'SU1763', 2, '2022-12-11 18:00:00', '2022-12-12 02:00:00', 20, 2),
    (13, 2, 'SU3325', 3, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 13, 3),
    (14, 3, 'S76434', 4, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 18, 4),
    (15, 4, 'UT248', 5, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 1, 5),
    (16, 4, 'UT257', 6, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 3, 6),
    (17, 3, 'S73665', 7, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 9, 7),
    (18, 4, 'UT349', 8, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 10, 8),
    (19, 3, 'S77865', 9, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 12, 9),
    (20, 3, 'S79874', 10, '2022-12-11 18:00:00', '2022-12-11 21:00:00', 5, 10)

 * postgresql://postgres:***@localhost:5432/airport
20 rows affected.

[]

In [11]:
%%sql

INSERT INTO passengers (id, first_name, last_name, email, phone, passport_num, flight_id)
VALUES
    (1, 'John', 'Smith', 'johnsmith@email.com', '123-456-7890', 'ABC123', 1),
    (2, 'Jane', 'Doe', 'janedoe@email.com', '123-456-7891', 'DEF456', 2),
    (3, 'Robert', 'Jones', 'robertjones@email.com', '123-456-7892', 'GHI789', 3),
    (4, 'Emily', 'Wong', 'emilywong@email.com', '123-456-7893', 'JKL012', 4),
    (5, 'Michael', 'Brown', 'michaelbrown@email.com', '123-456-7894', 'MNO345', 5),
    (6, 'William', 'Garcia', 'williamgarcia@email.com', '123-456-7895', 'PQR678', 6),
    (7, 'Elizabeth', 'Green', 'elizabethgreen@email.com', '123-456-7896', 'STU901', 7),
    (8, 'David', 'Harris', 'davidharris@email.com', '123-456-7897', 'VWX234', 8),
    (9, 'Jennifer', 'Rodriguez', 'jenniferrodriguez@email.com', '123-456-7898', 'YZABCD', 9),
    (10, 'Maria', 'Sanchez', 'mariasanchez@email.com', '123-456-7899', 'EFGHIJ', 10),
    (11, 'James', 'Martinez', 'jamesmartinez@email.com', '123-456-7900', 'KLMNOP', 11),
    (12, 'Sarah', 'Taylor', 'sarahtaylor@email.com', '123-456-7901', 'QRSTUV', 12),
    (13, 'Joseph', 'Parker', 'josephparker@email.com', '123-456-7902', 'WXYZAB', 13),
    (14, 'Jessica', 'Williams', 'jessicawilliams@email.com', '123-456-7903', 'CDEFGH', 14),
    (15, 'Christopher', 'Thomas', 'christopherthomas@email.com', '123-456-7904', 'IJKLMN', 15),
    (16, 'Samantha', 'Lee', 'samanthalee@email.com', '123-456-7905', 'OPQRST', 16),
    (17, 'George', 'Johnson', 'georgejohnson@email.com', '123-456-7906', 'UVWXYZ', 17),
    (18, 'Daniel', 'King', 'danielking@email.com', '123-456-7907', 'AHDNEO', 18),
    (19, 'Melissa', 'Scott', 'melissascott@email.com', '123-456-7908', 'ABC123', 19),
    (20, 'Ashley', 'White', 'ashleywhite@email.com', '123-456-7909', 'DEF456', 20),
    (21, 'Andrew', 'Martin', 'andrewmartin@email.com', '123-456-7910', 'GHI789', 1),
    (22, 'Emma', 'Phillips', 'emmaphillips@email.com', '123-456-7911', 'JKL012', 2),
    (23, 'Sarah', 'Moore', 'sarahmoore@email.com', '123-456-7912', 'MNO345', 3),
    (24, 'Jason', 'Miller', 'jasonmiller@email.com', '123-456-7913', 'PQR678', 4),
    (25, 'Samantha', 'Harris', 'samanthaharris@email.com', '123-456-7914', 'STU901', 5),
    (26, 'Laura', 'Moore', 'lauramoore@email.com', '123-456-7915', 'VWX234', 6),
    (27, 'Anthony', 'Thomas', 'anthonythomas@email.com', '123-456-7916', 'YZABCD', 7),
    (28, 'Emily', 'Lee', 'emilylee@email.com', '123-456-7917', 'EFGHIJ', 8),
    (29, 'David', 'Jones', 'davidjones@email.com', '123-456-7918', 'KLMNOP', 9),
    (30, 'Megan', 'Rodriguez', 'meganrodriguez@email.com', '123-456-7919', 'QRSTUV', 10);

 * postgresql://postgres:***@localhost:5432/airport
30 rows affected.

[]

In [12]:
%%sql

INSERT INTO employees (id, first_name, last_name, email, phone, position, terminal_id)
VALUES
    (1, 'John', 'Smith', 'johnsmith@email.com', '555-555-5555', 'Manager', 1),
    (2, 'Jane', 'Doe', 'janedoe@email.com', '555-555-5556', 'Assistant Manager', 2),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com', '555-555-5557', 'Cashier', 1),
    (4, 'Alice', 'Brown', 'alicebrown@email.com', '555-555-5558', 'Cashier', 2),
    (5, 'Sam', 'Miller', 'sammiller@email.com', '555-555-5559', 'Stocker', 1),
    (6, 'Sara', 'Garcia', 'saragarcia@email.com', '555-555-5560', 'Stocker', 2),
    (7, 'Tom', 'Wilson', 'tomwilson@email.com', '555-555-5561', 'Supervisor', 1),
    (8, 'Linda', 'Jones', 'lindajones@email.com', '555-555-5562', 'Supervisor', 2),
    (9, 'David', 'Taylor', 'davidsmith@email.com', '555-555-5563', 'Manager', 1),
    (10, 'Emma', 'Roberts', 'emmaroberts@email.com', '555-555-5564', 'Assistant Manager', 2);

 * postgresql://postgres:***@localhost:5432/airport
10 rows affected.

[]

# Airport  departures table

In [13]:
%%sql

SELECT flights.flight_number AS Flight, airlines.name AS Airline, destinations.name AS Destination, flights.departure_time AS Departure, gates.name AS Gate, planes.plane_type AS Aircraft
FROM flights
INNER JOIN airlines ON flights.airline_id = airlines.id
INNER JOIN destinations ON flights.destination_id = destinations.id
INNER JOIN gates ON flights.gate_id = gates.id
INNER JOIN planes ON flights.plane_id = planes.id
ORDER BY flights.departure_time ASC;

 * postgresql://postgres:***@localhost:5432/airport
20 rows affected.

[('SU20', 'Aeroflot', 'Pulkovo Airport', datetime.datetime(2022, 12, 11, 12, 0), 'Gate 1A', 'Airbus A320'),
 ('SU1704', 'Aeroflot', 'Vladivostok International Airport', datetime.datetime(2022, 12, 11, 13, 0), 'Gate 2A', 'Boeing 777-300'),
 ('SU1610', 'Aeroflot', 'Sochi International Airport', datetime.datetime(2022, 12, 11, 14, 0), 'Gate 3A', 'Airbus A321'),
 ('SU7020', 'Rossiya Airlines', 'Nizhny Novgorod International Airport', datetime.datetime(2022, 12, 11, 15, 0), 'Gate 4A', 'Sukhoi 95'),
 ('S71133', 'S7 Airlines', 'Kazan International Airport', datetime.datetime(2022, 12, 11, 16, 0), 'Gate 5A', 'Airbus A320'),
 ('S71245', 'S7 Airlines', 'Tolmachevo Airport', datetime.datetime(2022, 12, 11, 17, 0), 'Gate 1B', 'Airbus A320'),
 ('SU3453', 'Rossiya Airlines', 'Rostov-on-Don Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 2B', 'Airbus A320'),
 ('S74532', 'S7 Airlines', 'Ufa International Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 3B', 'Airbus A320'),
 ('SU5489', 'Aeroflot', 'Pashkovsky Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 4B', 'Boeing 737-800'),
 ('SU3353', 'Rossiya Airlines', 'Mineralnye Vody Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 5B', 'Sukhoi 95'),
 ('SU3443', 'Rossiya Airlines', 'Pulkovo Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 1A', 'Sukhoi 95'),
 ('SU1763', 'Aeroflot', 'Vladivostok International Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 2A', 'Boeing 777-300'),
 ('SU3325', 'Rossiya Airlines', 'Sochi International Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 3A', 'Airbus A319'),
 ('S76434', 'S7 Airlines', 'Nizhny Novgorod International Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 4A', 'Airbus A320'),
 ('UT248', 'UTair Aviation', 'Kazan International Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 5A', 'Boeing 737-800'),
 ('UT257', 'UTair Aviation', 'Tolmachevo Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 1B', 'Boeing 737'),
 ('S73665', 'S7 Airlines', 'Rostov-on-Don Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 2B', 'Airbus A320'),
 ('UT349', 'UTair Aviation', 'Ufa International Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 3B', 'Boeing 737-800'),
 ('S77865', 'S7 Airlines', 'Pashkovsky Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 4B', 'Airbus A320'),
 ('S79874', 'S7 Airlines', 'Mineralnye Vody Airport', datetime.datetime(2022, 12, 11, 18, 0), 'Gate 5B', 'Airbus A320')]

### Selecting passengers departing from 10:00 to 12:00

In [14]:
%%sql

SELECT * 
FROM passengers 
WHERE flight_id IN (SELECT id FROM flights WHERE departure_time BETWEEN '2022-12-11 10:00:00' AND '2022-12-11 12:00:00');

 * postgresql://postgres:***@localhost:5432/airport
2 rows affected.

[(1, 'John', 'Smith', 'johnsmith@email.com', '123-456-7890', 'ABC123', 1),
 (21, 'Andrew', 'Martin', 'andrewmartin@email.com', '123-456-7910', 'GHI789', 1)]

### Selecting all departures from Terminal 1

In [15]:
%%sql

SELECT * 
FROM flights 
INNER JOIN gates ON flights.gate_id = gates.id WHERE gates.terminal_id = 1;

 * postgresql://postgres:***@localhost:5432/airport
10 rows affected.

[(1, 1, 'SU20', 1, datetime.datetime(2022, 12, 11, 12, 0), datetime.datetime(2022, 12, 11, 14, 0), 2, 1, 1, 'Gate 1A', 1),
 (2, 1, 'SU1704', 2, datetime.datetime(2022, 12, 11, 13, 0), datetime.datetime(2022, 12, 11, 21, 0), 4, 2, 2, 'Gate 2A', 1),
 (3, 1, 'SU1610', 3, datetime.datetime(2022, 12, 11, 14, 0), datetime.datetime(2022, 12, 11, 17, 0), 15, 3, 3, 'Gate 3A', 1),
 (4, 2, 'SU7020', 4, datetime.datetime(2022, 12, 11, 15, 0), datetime.datetime(2022, 12, 11, 16, 30), 6, 4, 4, 'Gate 4A', 1),
 (5, 3, 'S71133', 5, datetime.datetime(2022, 12, 11, 16, 0), datetime.datetime(2022, 12, 11, 18, 0), 11, 5, 5, 'Gate 5A', 1),
 (11, 2, 'SU3443', 1, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 20, 0), 17, 1, 1, 'Gate 1A', 1),
 (12, 1, 'SU1763', 2, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 12, 2, 0), 20, 2, 2, 'Gate 2A', 1),
 (13, 2, 'SU3325', 3, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 13, 3, 3, 'Gate 3A', 1),
 (14, 3, 'S76434', 4, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 18, 4, 4, 'Gate 4A', 1),
 (15, 4, 'UT248', 5, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 1, 5, 5, 'Gate 5A', 1)]

### Selecting all flights to be operated using an Airbus A320

In [4]:
%%sql

SELECT * 
FROM flights 
INNER JOIN planes ON flights.plane_id = planes.id WHERE planes.plane_type = 'Airbus A320'
INNER JOIN airlines ON flights.airline_id = airlines.id

 * postgresql://postgres:***@localhost:5432/airport
(psycopg2.errors.SyntaxError) syntax error at or near "INNER"
LINE 4: INNER JOIN airlines ON flights.airline_id = airlines.id
        ^

[SQL: SELECT *
FROM flights
INNER JOIN planes ON flights.plane_id = planes.id WHERE planes.plane_type = 'Airbus A320'
INNER JOIN airlines ON flights.airline_id = airlines.id]
(Background on this error at: https://sqlalche.me/e/14/f405)

### Selecting flights with at least one passenger with the last name "Smith", along with the destination

In [17]:
%%sql

SELECT * 
FROM flights 
INNER JOIN destinations ON flights.destination_id = destinations.id 
INNER JOIN passengers ON flights.id = passengers.flight_id WHERE passengers.last_name = 'Smith';

 * postgresql://postgres:***@localhost:5432/airport
1 rows affected.

[(1, 1, 'SU20', 1, datetime.datetime(2022, 12, 11, 12, 0), datetime.datetime(2022, 12, 11, 14, 0), 2, 1, 1, 'LED', 'Pulkovo Airport', 'Russia', 1, 'John', 'Smith', 'johnsmith@email.com', '123-456-7890', 'ABC123', 1)]

### Selecting flights from 12:00

In [18]:
%%sql

SELECT * FROM flights WHERE departure_time > '2022-12-11 12:00:00'

 * postgresql://postgres:***@localhost:5432/airport
19 rows affected.

[(2, 1, 'SU1704', 2, datetime.datetime(2022, 12, 11, 13, 0), datetime.datetime(2022, 12, 11, 21, 0), 4, 2),
 (3, 1, 'SU1610', 3, datetime.datetime(2022, 12, 11, 14, 0), datetime.datetime(2022, 12, 11, 17, 0), 15, 3),
 (4, 2, 'SU7020', 4, datetime.datetime(2022, 12, 11, 15, 0), datetime.datetime(2022, 12, 11, 16, 30), 6, 4),
 (5, 3, 'S71133', 5, datetime.datetime(2022, 12, 11, 16, 0), datetime.datetime(2022, 12, 11, 18, 0), 11, 5),
 (6, 3, 'S71245', 6, datetime.datetime(2022, 12, 11, 17, 0), datetime.datetime(2022, 12, 11, 20, 0), 19, 6),
 (7, 2, 'SU3453', 7, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 20, 0), 7, 7),
 (8, 3, 'S74532', 8, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 8, 8),
 (9, 1, 'SU5489', 9, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 20, 0), 14, 9),
 (10, 2, 'SU3353', 10, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 16, 10),
 (11, 2, 'SU3443', 1, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 20, 0), 17, 1),
 (12, 1, 'SU1763', 2, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 12, 2, 0), 20, 2),
 (13, 2, 'SU3325', 3, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 13, 3),
 (14, 3, 'S76434', 4, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 18, 4),
 (15, 4, 'UT248', 5, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 1, 5),
 (16, 4, 'UT257', 6, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 3, 6),
 (17, 3, 'S73665', 7, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 9, 7),
 (18, 4, 'UT349', 8, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 10, 8),
 (19, 3, 'S77865', 9, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 12, 9),
 (20, 3, 'S79874', 10, datetime.datetime(2022, 12, 11, 18, 0), datetime.datetime(2022, 12, 11, 21, 0), 5, 10)]

### Selecting the busiest gate

In [19]:
%%sql

SELECT gates.name, COUNT(gates.name) as "Number of flights"
FROM gates
JOIN flights ON gates.id = flights.gate_id
GROUP BY gates.name
ORDER BY "Number of flights" DESC
LIMIT 1;

 * postgresql://postgres:***@localhost:5432/airport
1 rows affected.

[('Gate 2B', 2)]

### Selecting passengers flying together

In [20]:
%%sql

SELECT p1.first_name, p1.last_name, p2.first_name, p2.last_name
FROM passengers p1
JOIN passengers p2 ON p1.flight_id = p2.flight_id
WHERE p1.id != p2.id;

 * postgresql://postgres:***@localhost:5432/airport
20 rows affected.

[('John', 'Smith', 'Andrew', 'Martin'),
 ('Jane', 'Doe', 'Emma', 'Phillips'),
 ('Robert', 'Jones', 'Sarah', 'Moore'),
 ('Emily', 'Wong', 'Jason', 'Miller'),
 ('Michael', 'Brown', 'Samantha', 'Harris'),
 ('William', 'Garcia', 'Laura', 'Moore'),
 ('Elizabeth', 'Green', 'Anthony', 'Thomas'),
 ('David', 'Harris', 'Emily', 'Lee'),
 ('Jennifer', 'Rodriguez', 'David', 'Jones'),
 ('Maria', 'Sanchez', 'Megan', 'Rodriguez'),
 ('Andrew', 'Martin', 'John', 'Smith'),
 ('Emma', 'Phillips', 'Jane', 'Doe'),
 ('Sarah', 'Moore', 'Robert', 'Jones'),
 ('Jason', 'Miller', 'Emily', 'Wong'),
 ('Samantha', 'Harris', 'Michael', 'Brown'),
 ('Laura', 'Moore', 'William', 'Garcia'),
 ('Anthony', 'Thomas', 'Elizabeth', 'Green'),
 ('Emily', 'Lee', 'David', 'Harris'),
 ('David', 'Jones', 'Jennifer', 'Rodriguez'),
 ('Megan', 'Rodriguez', 'Maria', 'Sanchez')]

### Selecting the number of employees by terminal

In [21]:
%%sql

SELECT terminals.name, COUNT(employees.id)
FROM terminals
JOIN employees ON terminals.id = employees.terminal_id
GROUP BY terminals.name
ORDER BY COUNT(employees.id) DESC;

 * postgresql://postgres:***@localhost:5432/airport
2 rows affected.

[('Terminal 1', 5), ('Terminal 2', 5)]

### Selecting the number of flights by employee

In [22]:
%%sql

SELECT e.first_name, e.last_name, COUNT(f.id) AS total_flights
FROM employees e
JOIN gates g ON e.terminal_id = g.terminal_id
JOIN flights f ON g.id = f.gate_id
GROUP BY e.id
ORDER BY total_flights DESC;

 * postgresql://postgres:***@localhost:5432/airport
10 rows affected.

[('Alice', 'Brown', 10),
 ('Emma', 'Roberts', 10),
 ('David', 'Taylor', 10),
 ('Tom', 'Wilson', 10),
 ('Sara', 'Garcia', 10),
 ('Bob', 'Johnson', 10),
 ('John', 'Smith', 10),
 ('Sam', 'Miller', 10),
 ('Jane', 'Doe', 10),
 ('Linda', 'Jones', 10)]

### Selecting the number of flights by part of the day (4 parts in 24h00)

In [16]:
%%sql

SELECT
CASE
WHEN EXTRACT(HOUR FROM departure_time) BETWEEN 0 AND 5 THEN '00.00 to 05.59'
WHEN EXTRACT(HOUR FROM departure_time) BETWEEN 6 AND 11 THEN '06.00 to 11.59'
WHEN EXTRACT(HOUR FROM departure_time) BETWEEN 12 AND 17 THEN '12.00 to 17.59'
ELSE '18.00 to 23.59'
END as time_range,
COUNT(*) as flights
FROM flights
GROUP BY time_range
ORDER BY flights DESC;

 * postgresql://postgres:***@localhost:5432/airport
2 rows affected.

[('18.00 to 23.59', 14), ('12.00 to 17.59', 6)]